       identification division.
       program-id. MFWAIT.

       environment division.
       configuration section.

       data division.
       working-storage section.
       01  ws-data      pic x(50).

       procedure division.

           accept ws-data from console

           goback.
           
       end program MFWAIT.
